LM-HieuNM/Esp32s3_demo_qr/src/main.cpp
uint8_t ext[] PROGMEM = {
    // APP DATA
    0xA0, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x54, 0x65, 0x73, 0x74, 0x20, 0x41, 0x70, 0x70, 0x00,

    // UI COMPONENTS
    // d, type, comp id   , parent id ,    x pos  ,    y pos  ,   width  ,   height   , text ..... terminator
    0xAA, 0x01, 0x10, 0x01, 0xAB, 0x01, 0x00, 0x14, 0x00, 0x14, 0x00, 0x19, 0x00, 0x19, 0x48, 0x65, 0x6c, 0x6c, 0x6f, 0x20, 0x77, 0x6f, 0x72, 0x6c, 0x64, 0x00,
    0xAA, 0x02, 0x10, 0x02, 0xAB, 0x01, 0x00, 0x14, 0x00, 0x46, 0x00, 0x64, 0x00, 0x00, 0x43, 0x6c, 0x69, 0x63, 0x6b, 0x00,
    0xAA, 0x05, 0x10, 0x03, 0xAB, 0x01, 0x00, 0x14, 0x00, 0x96, 0x00, 0xFA, 0x00, 0x05, 0x00,
    0xAA, 0x07, 0x10, 0x04, 0xAB, 0x01, 0x00, 0x14, 0x00, 0xFA, 0x00, 0x32, 0x00, 0x14, 0x00,
    0xAA, 0x01, 0x10, 0x05, 0xAB, 0x01, 0x00, 0x14, 0x01, 0x2C, 0x00, 0x19, 0x00, 0x19, 0x4c, 0x6f, 0x72, 0x65, 0x6d, 0x20, 0x69, 0x70, 0x73, 0x75, 0x6d, 0x20, 0x64, 0x6f, 0x6c, 0x6f, 0x72, 0x20, 0x0a, 0x73, 0x69, 0x74, 0x20, 0x61, 0x6d, 0x65, 0x74, 0x2c, 0x20, 0x63, 0x6f, 0x6e, 0x73, 0x65, 0x63, 0x74, 0x65, 0x74, 0x75, 0x72, 0x20, 0x0a, 0x61, 0x64, 0x69, 0x70, 0x69, 0x73, 0x63, 0x69, 0x6e, 0x67, 0x20, 0x65, 0x6c, 0x69, 0x74, 0x2e, 0x00
    };

AppComponent testApp[10];


void extractApp(uint8_t *data, int size)
{

  int a = 0, i = 0, j, z = size;
  uint8_t buf[100];
  while (1)
  {
    // copy component data to buffer
    for (j = 0; j < 14; j++)
    {
      if (i >= z)
      {
        break; // not enough data for component
      }
      buf[j] = data[i];
      i++;
    }
    while (1)
    {
      buf[j] = data[i];
      j++;
      i++;
      if (buf[j - 1] == 0x00)
      {
        break; // component terminator found
      }
      if (i >= z)
      {
        break; // component terminator not found & end of component data
      }
    }
    if (buf[j - 1] != 0x00)
    {
      break; // component incomplete
    }

    // component info was loaded to buffer
    if (buf[0] == 0xAA)
    {
      testApp[a].type = (Type)buf[1];
      testApp[a].id = buf[2] << 8 | buf[3];
      testApp[a].parent = buf[4] << 8 | buf[5];
      testApp[a].xPos = buf[6] << 8 | buf[7];
      testApp[a].yPos = buf[8] << 8 | buf[9];
      testApp[a].width = buf[10] << 8 | buf[11];
      testApp[a].height = buf[12] << 8 | buf[13];
      strncpy(testApp[a].text, (char *)buf + 14, j - 14);
      printf("App UI Component > 0x%X\n", uuid(testApp[a].parent, testApp[a].id));
      a++;
    }
    else if (buf[0] == 0xA0)
    {
      char appName[20];
      strncpy(appName, (char *)buf + 14, j - 14);
      printf("App Name %s\n", appName);
    }
  }
}

/* Display flushing */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p)
{
  if (tft.getStartCount() == 0)
  {
    tft.endWrite();
  }

  tft.pushImageDMA(area->x1, area->y1, area->x2 - area->x1 + 1, area->y2 - area->y1 + 1, (lgfx::swap565_t *)&color_p->full);

  lv_disp_flush_ready(disp); /* tell lvgl that flushing is done */
}

/*Read the touchpad*/
void my_touchpad_read(lv_indev_drv_t *indev_driver, lv_indev_data_t *data)
{
// #ifdef PLUS
  uint16_t touchX, touchY;

  bool touched = tft.getTouch(&touchX, &touchY);

  if (!touched)
  {
    data->state = LV_INDEV_STATE_REL;
  }
  else
  {
    data->state = LV_INDEV_STATE_PR;

    /*Set the coordinates*/
    data->point.x = touchX;
    data->point.y = touchY;
    currentMillis = millis();
  }
// #else
//   data->point.x = touch_data.xpos;
//   data->point.y = touch_data.ypos;

//   if (touch_data.event == 1)
//   {
//     data->state = LV_INDEV_STATE_PR;
//     currentMillis = millis();
//   }
//   else
//   {
//     data->state = LV_INDEV_STATE_REL;
//   }
// #endif
}

void requestResult(int requestCode, int statusCode, String payload, long time)
{

  Serial.printf("Request %d received, time %dms, code: %d\n", requestCode, time, statusCode);

  if (statusCode == HTTP_CODE_OK)
  {
    Serial.println(payload);
  }

  switch (requestCode)
  {
  case TIME_REQUEST:
    if (statusCode == HTTP_CODE_OK)
    {
      DynamicJsonDocument json(100);
      deserializeJson(json, payload);
      long t = json["timestamp"].as<long>();
      rtc.setTime(t);
    }
    break;
  case APPS_REQUEST:
    if (statusCode == HTTP_CODE_OK)
    {
      DynamicJsonDocument json(2048);
      deserializeJson(json, payload);
      JsonArray array = json.as<JsonArray>();
      int x = 0;

      for (JsonVariant j : array)
      {
        JsonObject v = j.as<JsonObject>();
        String name = v["name"].as<String>();
        strncpy(appList[x].name, name.c_str(), name.length() + 1);
        appList[x].id = v["id"].as<uint32_t>();
        appList[x].version = v["version"].as<uint32_t>();
        appList[x].size = v["size"].as<uint32_t>();
        appList[x].state = true;
        x++;

        if (x >= MAX_APPS)
        {
          break;
        }
      }
    }
    break;
#ifdef PLUS
  case BLOG_REQUEST:
    if (statusCode == HTTP_CODE_OK)
    {
      DynamicJsonDocument json(2048);
      deserializeJson(json, payload);
      if (json["success"])
      {
        JsonArray array = json["article"].as<JsonArray>();
        for (JsonVariant j : array)
        {
          JsonObject v = j.as<JsonObject>();
          String text = v["text"].as<String>();
          uint16_t id = v["id"].as<uint16_t>();
          String link = v["image"].as<String>();
          add_blog_item(blogList, text.c_str(), id);
        }
      } else {
        blogText(ui_blogPanel, 50, "Failed to load the blog list");
      }
    } else {
      blogText(ui_blogPanel, 50, "Failed to load the blog list");
    }
    lv_obj_add_flag(ui_blogSpinner, LV_OBJ_FLAG_HIDDEN);
    break;
  case BLOG_ITEM_REQUEST:
    blog_panel(ui_appPanel);
    lv_obj_clear_flag(ui_blogSpinner, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(blogList, LV_OBJ_FLAG_HIDDEN);
    if (statusCode == HTTP_CODE_OK)
    {

      DynamicJsonDocument json(4096);
      deserializeJson(json, payload);
      if (json["success"])
      {

        String title = json["title"].as<String>();
        lv_obj_t *t = blogTitle(ui_blogPanel, (char *)title.c_str());
        lv_obj_set_style_text_font(t, &lv_font_montserrat_18, LV_PART_MAIN | LV_STATE_DEFAULT);
        lv_obj_update_layout(t);
        int16_t y = lv_obj_get_height(t);
        y += 10;

        JsonArray array = json["text"].as<JsonArray>(); // text
        for (JsonVariant j : array)
        {
          String text = j.as<String>();
          lv_obj_t *p = blogText(ui_blogPanel, y, (char *)text.c_str());
          lv_obj_update_layout(p);
          y += 10;
          y += lv_obj_get_height(p);
        }

        JsonArray images = json["image"].as<JsonArray>(); // images
        for (JsonVariant j : images)
        {
          String link = j.as<String>();
        }
      }
      else
      {
        blogText(ui_blogPanel, 50, "Failed to load the blog");
      }
    }
    else
    {
      blogText(ui_blogPanel, 50, "Failed to load the blog");
    }
    lv_obj_add_flag(ui_blogSpinner, LV_OBJ_FLAG_HIDDEN);
    lv_obj_scroll_by(ui_blogPanel, 0, 2, LV_ANIM_ON);
    break;
    #endif
  }
}

void sendRequest(void *parameter)
{
  long t;

  for (int r = 0; r < MAX_REQUEST; r++)
  {
    if (request[r].active)
    {
      t = millis();
      http.begin(request[r].url);
      int httpCode;
      if (request[r].method)
      {
        httpCode = http.POST(request[r].data);
      }
      else
      {
        httpCode = http.GET();
      }

      String payload = http.getString();

