LM-HieuNM/Esp32s3_demo_qr/src/main.cpp
      // http.end();
      t = millis() - t;
      requestResult(request[r].code, httpCode, payload, t);
      request[r].active = false;
    }
  }
  http.end();
  activeRequest = false;
  // When you're done, call vTaskDelete. Don't forget this!
  vTaskDelete(NULL);
}

void connectWiFi(void *parameter)
{
  uint8_t status;
  while (true)
  {
    status = wifiMulti.run();
    Serial.printf("WiFi trying: %d\n", status);
    if (status == WL_CONNECTED || status == WL_CONNECT_FAILED || status == WL_DISCONNECTED || status == WL_NO_SSID_AVAIL)
    {
      break;
    }
  }
  Serial.printf("WiFi exit: %d\n", status);
  // When you're done, call vTaskDelete. Don't forget this!
  vTaskDelete(NULL);
}

bool runRequest()
{
  // returns true if the task was created
  // returns false if the previous task has not completed, new one cannot be created
  if (!activeRequest)
  {
    activeRequest = true;
    // xTaskCreatePinnedToCore(
    xTaskCreate(
        sendRequest,     // Function that should be called
        "HTTP Requests", // Name of the task (for debugging)
        8192,            // Stack size (bytes)
        NULL,            // Parameter to pass
        1,               // Task priority
        NULL
        // NULL,               // Task handle
        // 1
    );

    return true;
  }
  else
  {
    return false;
  }
}

#ifdef MUSIC_PLAYER
void musicPlayer(void *parameter)
{

  while (playing)
  {
    audio.loop();

    uint32_t act = audio.getAudioCurrentTime();
    uint32_t afd = audio.getAudioFileDuration();

    int progress = 0;
    if (afd != 0)
    {
      progress = int((act * 100.0) / afd);
      lv_bar_set_value(ui_musicProgress, progress, LV_ANIM_ON);

      lv_label_set_text_fmt(ui_musicPlayTime, "%02d:%02d", act / 60, act % 60);
      lv_label_set_text_fmt(ui_musicTotalTime, "%02d:%02d", afd / 60, afd % 60);
    }
    // uint32_t pos =audio.getFilePos();
  }
  vTaskDelete(NULL);
}

void runMusic()
{

  // musicPlay_Animation(ui_musicAlbumArt, 0);
  if (!playing)
  {
    playing = true;
    xTaskCreatePinnedToCore(
        // xTaskCreate(
        musicPlayer,    // Function that should be called
        "Music Player", // Name of the task (for debugging)
        16384,          // Stack size (bytes)
        NULL,           // Parameter to pass
        1,              // Task priority
        // NULL
        NULL, // Task handle
        1);
  }
}

void playFile(const char *track)
{
  audio.connecttoFS(SD, track);

  runMusic();
}

void playPause()
{
  audio.pauseResume();
  bool isPlay = audio.isRunning();
}

void changeMusic(bool forward)
{

  int r = random(MAX_MUSIC);
  playFile(music[r].path);
}

void listMusic(fs::FS &fs, const char *dirname, uint8_t levels)
{
  Serial.printf("Listing directory: %s\n", dirname);

  File root = fs.open(dirname);
  if (!root)
  {
    Serial.println("Failed to open directory");
    return;
  }
  if (!root.isDirectory())
  {
    Serial.println("Not a directory");
    return;
  }

  File file = root.openNextFile();
  int x = 0;
  while (file)
  {
    if (!file.isDirectory())
    {

      String fileName = String(file.name());
      if (!fileName.startsWith(".") && fileName.endsWith(".mp3") && x < MAX_MUSIC)
      {
        Serial.print("  MP3 ");

        fileName = "/" + fileName;
        strncpy(music[x].path, fileName.c_str(), fileName.length() + 1);
        music[x].id = x;
        music[x].size = (uint32_t)file.size();
        x++;
      }

      Serial.print("  FILE: ");
      Serial.print(file.name());
      Serial.print("  SIZE: ");
      Serial.println(file.size());
    }
    file = root.openNextFile();
  }
}

void getMusicList()
{
  int v = audio.getVolume();
  lv_slider_set_value(ui_musicVolume, v, LV_ANIM_ON);

  listMusic(SD, "/", 0);
}
#endif

#ifdef PLUS
void getFileList(lv_obj_t *parent, const char *path)
{

  File root = SD.open(path);
  if (!root)
  {
    Serial.println("Failed to open directory");
    return;
  }
  if (!root.isDirectory())
  {
    Serial.println("Not a directory");
    return;
  }

  File file = root.openNextFile();
  while (file)
  {
    String fileName = String(file.name());
    // char n[50];
    // strncpy(n, fileName.c_str(), fileName.length() + 1);
    if (!fileName.startsWith("."))
    {
      add_file_item(parent, (char *)fileName.c_str(), file.size(), !file.isDirectory());
    }
    file = root.openNextFile();
  }
}
#endif

#ifdef LVGL_LOOP
void lvgl_loop(void *parameter)
{

  while (true)
  {
    lv_timer_handler();
    delay(5);
  }
  vTaskDelete(NULL);
}

void guiHandler()
{

  xTaskCreatePinnedToCore(
      // xTaskCreate(
      lvgl_loop,   // Function that should be called
      "LVGL Loop", // Name of the task (for debugging)
      16384,       // Stack size (bytes)
      NULL,        // Parameter to pass
      1,           // Task priority
      // NULL
      NULL, // Task handle
      1);
}
#endif

void getNVSData()
{
  String val;
  val = NVS.getString("ssid1");
  strncpy(ssid1, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid2");
  strncpy(ssid2, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid3");
  strncpy(ssid3, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid4");
  strncpy(ssid4, val.c_str(), val.length() + 1);
  val = NVS.getString("ssid5");
  strncpy(ssid5, val.c_str(), val.length() + 1);
  val = NVS.getString("pass1");
  strncpy(pass1, val.c_str(), val.length() + 1);
  val = NVS.getString("pass2");
  strncpy(pass2, val.c_str(), val.length() + 1);
  val = NVS.getString("pass3");
  strncpy(pass3, val.c_str(), val.length() + 1);
  val = NVS.getString("pass4");
  strncpy(pass4, val.c_str(), val.length() + 1);
  val = NVS.getString("pass5");
  strncpy(pass5, val.c_str(), val.length() + 1);
  brightness = NVS.getInt("brightness", brightness);
  themeColor = NVS.getInt("theme", themeColor);
  screenTime = (long)NVS.getInt("screentime", (uint32_t)screenTime);

  NVS.getBlob("passCode", passcode.code, 4);
  passcode.set = NVS.getInt("passSet", 0) != 0;

  printf("loaded screentime %d\n", screenTime);

  Serial.printf("Passcode loaded %s - %d%d%d%d\n", passcode.set ? "ON" : "OFF", passcode.code[0], passcode.code[1], passcode.code[2], passcode.code[3]);
}

void setWifi()
{
  wifiMulti.addAP(ssid1, pass1);
  wifiMulti.addAP(ssid2, pass2);
  wifiMulti.addAP(ssid3, pass3);
  wifiMulti.addAP(ssid4, pass4);
  wifiMulti.addAP(ssid5, pass5);

