LM-HieuNM/Esp32s3_demo_qr/src/main.cpp
  String wifiList = "Saved Wifi";
  wifiList += "\n1. " + String(ssid1);
  wifiList += "\n2. " + String(ssid2);
  wifiList += "\n3. " + String(ssid3);
  wifiList += "\n4. " + String(ssid4);
  wifiList += "\n5. " + String(ssid5);

  lv_label_set_text(ui_appWifiList, wifiList.c_str());
}

void saveWifiList()
{
  setWifi();
  NVS.setString("ssid1", String(ssid1));
  NVS.setString("ssid2", String(ssid2));
  NVS.setString("ssid3", String(ssid3));
  NVS.setString("ssid4", String(ssid4));
  NVS.setString("ssid5", String(ssid5));
  NVS.setString("pass1", String(pass1));
  NVS.setString("pass2", String(pass2));
  NVS.setString("pass3", String(pass3));
  NVS.setString("pass4", String(pass4));
  NVS.setString("pass5", String(pass5));
}

void saveSettings()
{
  NVS.setInt("brightness", brightness);
  NVS.setInt("theme", themeColor);
  NVS.setBlob("passCode", passcode.code, 4);
  NVS.setInt("passSet", passcode.set ? 1 : 0);
  NVS.setInt("screentime", (uint32_t)screenTime);
  Serial.printf("Passcode set %s - %d%d%d%d\n", passcode.set ? "ON" : "OFF", passcode.code[0], passcode.code[1], passcode.code[2], passcode.code[3]);
  printf("saved screentime %d\n", screenTime);
}

lv_obj_t *create_component(lv_obj_t *parent, AppComponent component)
{
  lv_obj_t *object;
  printf("Comp %d, x:%d, y:%d > %s\n", component.type, component.xPos, component.yPos, &component.text);
  if (component.type == LABEL)
  {
    object = create_label(parent, component.text, component.yPos);
  }
  else if (component.type == BUTTON)
  {
    object = create_button(parent, uuid(component.parent, component.id), component.text, component.xPos, component.yPos, component.width, component.height);
  }
  else if (component.type == SLIDER)
  {
    object = create_slider(parent, uuid(component.parent, component.id), component.xPos, component.yPos, component.width, component.height);
  }
  else if (component.type == SWITCH)
  {
    object = create_switch(parent, uuid(component.parent, component.id), component.xPos, component.yPos);
  }
  else
  {
    object = NULL;
  }

  return object;
}

void loadLocalApp(const char *path, int &size)
{
  Serial.printf("Reading file: %s\r\n", path);
  int z = 0;
  File file = SPIFFS.open(path);
  if (!file || file.isDirectory())
  {
    Serial.println("- failed to open file for reading");
    return;
  }
  Serial.println("- read from file:");
  while (file.available())
  {
    Serial.write(file.read());
    z++;
  }
  file.close();
}

void loadTestApp()
{
  size_t n = 10;
  appSize = n;
  extractApp(ext, sizeof(ext) / sizeof(ext[0]));

  closeApp();

  lv_obj_t *container = app_canvas();

  for (int i = 0; i < n; i++)
  {
    if (testApp[i].parent != 0)
    {
      // activeApp[i] = create_component(container, testApp[i]);
      create_component(container, testApp[i]);
    }
  }

  launchApp("Test App", &ui_img_gear_png, true);
}

void deep_sleep()
{

  vibrate(100);

  tft.setBrightness(0);

  esp_sleep_enable_ext0_wakeup(WAKE_PIN, 0); // 1 = High, 0 = Low

  // Go to sleep now
  Serial.println("Going to deep sleep now");
  esp_deep_sleep_start();
}

void wakeup_reason()
{
  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch (wakeup_reason)
  {
  case ESP_SLEEP_WAKEUP_EXT0:
    Serial.println("Wakeup caused by external signal using RTC_IO");
    break;
  case ESP_SLEEP_WAKEUP_EXT1:
    Serial.println("Wakeup caused by external signal using RTC_CNTL");
    break;
  case ESP_SLEEP_WAKEUP_TIMER:
    Serial.println("Wakeup caused by timer");
    break;
  case ESP_SLEEP_WAKEUP_TOUCHPAD:
    Serial.println("Wakeup caused by touchpad");
    break;
  case ESP_SLEEP_WAKEUP_ULP:
    Serial.println("Wakeup caused by ULP program");
    break;
  default:
    Serial.printf("Wakeup was not caused by deep sleep: %d\n", wakeup_reason);
    rtc.setTime(1663491331); // Sunday, September 18, 2022 8:55:31 AM
    break;
  }
}

void light_sleep()
{
	// digitalWrite(MOTOR, LOW);
	tft.setBrightness(0);
	openLock();

	esp_sleep_enable_ext0_wakeup(WAKE_PIN, 0); // 1 = High, 0 = Low

	// Go to sleep now
	Serial.println("Going to light sleep now");
	esp_light_sleep_start();
}


//HieuNM Add

#ifdef LV_USE_QRCODE
lv_obj_t * ui_startScreen;
lv_obj_t * qr;
lv_obj_t * bank_label;
lv_obj_t * name_label;
lv_obj_t * account_label;

lv_obj_t *ui_Panel2;
lv_obj_t *ui_startButton;
lv_obj_t *ui_backButton;
lv_obj_t *ui_searchButton;
lv_obj_t *ui_BankName;

// static void event_navigate(lv_event_t *e)
// {
// 	Serial.print("event_navigate");
// }
// void navigation(lv_obj_t *parent)
// {
//     ui_Panel2 = lv_obj_create(parent);

//     lv_obj_set_width(ui_Panel2, 320);
//     lv_obj_set_height(ui_Panel2, 80);

//     lv_obj_set_x(ui_Panel2, 0);
//     lv_obj_set_y(ui_Panel2, 0);

//     lv_obj_set_align(ui_Panel2, LV_ALIGN_TOP_MID);

//     lv_obj_clear_flag(ui_Panel2, LV_OBJ_FLAG_SCROLLABLE);

//     lv_obj_set_style_radius(ui_Panel2, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
//     lv_obj_set_style_bg_color(ui_Panel2, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
//     lv_obj_set_style_bg_opa(ui_Panel2, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
//     lv_obj_set_style_border_width(ui_Panel2, 1, LV_PART_MAIN | LV_STATE_DEFAULT);
//     lv_obj_set_style_border_side(ui_Panel2, LV_BORDER_SIDE_TOP, LV_PART_MAIN | LV_STATE_DEFAULT);

//     // ui_startButton
//     ui_startButton = lv_imgbtn_create(ui_Panel2);
//     lv_imgbtn_set_src(ui_startButton, LV_IMGBTN_STATE_RELEASED, NULL, &Techcombank_logo, NULL);
// 	lv_obj_set_height(ui_startButton, Techcombank_logo.header.h);
//     lv_obj_set_width(ui_startButton, Techcombank_logo.header.w);

//     lv_obj_set_x(ui_startButton, 0);
//     lv_obj_set_y(ui_startButton, 0);
//     lv_obj_set_align(ui_startButton, LV_ALIGN_TOP_MID);
//     lv_obj_add_event_cb(ui_startButton, event_navigate, LV_EVENT_ALL, NULL);
// }

void ui_start_screen_init(void) {
	ui_startScreen = lv_obj_create(NULL);

	lv_obj_clear_flag(ui_startScreen, LV_OBJ_FLAG_SCROLLABLE);

	lv_obj_set_style_bg_color(ui_startScreen, lv_color_white(), LV_PART_MAIN);
	lv_obj_set_style_bg_opa(ui_startScreen, LV_OPA_COVER, LV_PART_MAIN);
	lv_scr_load(ui_startScreen);

	lv_color_t bg_color = lv_palette_lighten(LV_PALETTE_LIGHT_BLUE, 5);
	lv_color_t fg_color = lv_palette_darken(LV_PALETTE_NONE, 4);
	qr = lv_qrcode_create(ui_startScreen, 250, fg_color, bg_color);

	lv_obj_set_style_border_color(qr, bg_color, 0);
	lv_obj_set_style_border_width(qr, 5, 0);

	// bank_label = lv_label_create(ui_startScreen);
	name_label = lv_label_create(ui_startScreen);
	account_label = lv_label_create(ui_startScreen);

	ui_BankName = lv_imgbtn_create(ui_startScreen);

	// navigation(ui_startScreen);
}

