LM-HieuNM/Esp32s3_demo_qr/src/main.cpp
void lv_print_qrcode(const char* qr_text, const char* bank_name, const char* name, const char* account)
{
	printf("lv_print_qrcode\n");
	/*Set data*/
	lv_qrcode_update(qr, qr_text, strlen(qr_text));
	lv_obj_center(qr);
	lv_obj_set_align(qr, LV_ALIGN_CENTER);


    if (strcmp(bank_name, "Techcombank") == 0) {
        lv_imgbtn_set_src(ui_BankName, LV_IMGBTN_STATE_RELEASED, NULL, &techcombank, NULL);
		lv_obj_set_height(ui_BankName, techcombank.header.h);
		lv_obj_set_width(ui_BankName, techcombank.header.w);
    } else if (strcmp(bank_name, "Vietinbank") == 0) {
        lv_imgbtn_set_src(ui_BankName, LV_IMGBTN_STATE_RELEASED, NULL, &viettinbank, NULL);
		lv_obj_set_height(ui_BankName, viettinbank.header.h);
		lv_obj_set_width(ui_BankName, viettinbank.header.w);
    } else if (strcmp(bank_name, "MBBank") == 0) {
        lv_imgbtn_set_src(ui_BankName, LV_IMGBTN_STATE_RELEASED, NULL, &mbbank, NULL);
		lv_obj_set_height(ui_BankName, mbbank.header.h);
		lv_obj_set_width(ui_BankName, mbbank.header.w);
    } else if (strcmp(bank_name, "TPBank") == 0) {
        lv_imgbtn_set_src(ui_BankName, LV_IMGBTN_STATE_RELEASED, NULL, &tpbank, NULL);
		lv_obj_set_height(ui_BankName, tpbank.header.h);
		lv_obj_set_width(ui_BankName, tpbank.header.w);
    } else {
        // Default or unknown bank
        lv_imgbtn_set_src(ui_BankName, LV_IMGBTN_STATE_RELEASED, NULL, &viettinbank, NULL);
    }


    lv_obj_set_x(ui_BankName, 0);
    lv_obj_set_y(ui_BankName, 0);
    lv_obj_align_to(ui_BankName, qr, LV_ALIGN_OUT_TOP_MID, 0, -15);

	/*Add a border with bg_color*/

	// // Tạo các label trên màn hình mới
	// printf("lv_label_set_text bank\n");
	// lv_label_set_text(bank_label, bank_name);
	// lv_obj_set_style_text_font(bank_label, &lv_font_montserrat_32, 0);
	// lv_obj_set_style_text_color(bank_label, lv_color_black(), 0);  
	// lv_obj_align_to(bank_label, qr, LV_ALIGN_OUT_TOP_MID, 0, -10);

	lv_label_set_text(name_label, name);
	lv_obj_set_style_text_font(name_label, &lv_font_montserrat_24, 0);
	lv_obj_set_style_text_color(name_label, lv_color_black(), 0);
	lv_obj_align_to(name_label, qr, LV_ALIGN_OUT_BOTTOM_MID, 0, 5);

	lv_label_set_text(account_label, account);
	lv_obj_set_style_text_font(account_label, &lv_font_montserrat_20, 0);
	lv_obj_set_style_text_color(account_label, lv_color_black(), 0);  
	lv_obj_align_to(account_label, name_label, LV_ALIGN_OUT_BOTTOM_MID, 0, 1);

	printf("lv_print_qrcode end\n");
}
#endif

uint64_t lastTime = 0;

void lcd_1602_init() {
	Wire.begin(11, 10, 400000); 
	lcd.init();
	lcd.clear();

	// Print a message to the LCD.
	lcd.backlight();
	lcd.setCursor(3, 0);  
	lcd.print("Xin Chao !!");
}
//HieuNM End

void setup()
{
  Serial.begin(115200);

#ifdef MUSIC_PLAYER
  audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT);
#endif

  tft.init();
  tft.initDMA();
  tft.startWrite();

#ifdef PLUS

  pinMode(SD_CS, OUTPUT);
  digitalWrite(SD_CS, HIGH);
  SPI.begin(SDMMC_CLK, SDMMC_D0, SDMMC_CMD);
  SD.begin(SD_CS);

#endif

  NVS.begin();

  getNVSData();

  if (!SPIFFS.begin(FORMAT_SPIFFS_IF_FAILED))
  {
    Serial.println("SPIFFS Mount Failed");
    tft.setBrightness(brightness);

    delay(2000);
    ESP.restart();
  }

  wakeup_reason();

  lv_init();

  if (!disp_draw_buf)
  {
    Serial.println("LVGL disp_draw_buf allocate failed!");
  }
  else
  {

    Serial.print("Display buffer size: ");

    lv_disp_draw_buf_init(&draw_buf, disp_draw_buf, disp_draw_buf2, screenWidth * SCR);

    /* Initialize the display */
    lv_disp_drv_init(&disp_drv);
    /* Change the following line to your display resolution */
    disp_drv.hor_res = screenWidth;
    disp_drv.ver_res = screenHeight;
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.draw_buf = &draw_buf;
    lv_disp_drv_register(&disp_drv);

    /* Initialize the input device driver */
    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_touchpad_read;
    lv_indev_drv_register(&indev_drv);
  }
	tft.setBrightness(brightness);

#ifdef MUSIC_PLAYER
	audio.setVolume(21); // 0...21
	audio.forceMono(true);
#endif
	ui_start_screen_init();
	lv_print_qrcode("https://www.google.com", "Techcombank", "Nguyen Minh Hieu", "1234567890");
	lastTime = millis();

	lcd_1602_init();
}


void loop()
{
#ifndef LVGL_LOOP
	lv_timer_handler(); /* let the GUI do its work */
	delay(5);
#endif


	if (millis() - lastTime > 10000)
	{
		lastTime = millis();
		lv_print_qrcode("https://www.google.com", "Vietinbank", "Vu Thi Thu Huyen", "1902050999");
	}
    // rtcTime.day = rtc.getDay();
    // rtcTime.month = rtc.getMonth() + 1;
    // rtcTime.year = rtc.getYear();

    // tft.setBrightness(brightness);

    // if (WiFi.isConnected())
    // {
    //   lv_obj_clear_flag(ui_searchButton, LV_OBJ_FLAG_HIDDEN);
    //   if (!onConnect)
    //   {
    //     Serial.println("WiFi Connected");
    //     runRequest();
    //     onConnect = true;
    //   }
    // }
    // else
    // {
    //   onConnect = false;
    //   lv_obj_add_flag(ui_searchButton, LV_OBJ_FLAG_HIDDEN);
    // }
    // lv_label_set_text(ui_lockScreenTime, rtc.getTime("%H:%M").c_str());
    // lv_label_set_text(ui_lockTime, rtc.getTime("%H:%M").c_str());
    // lv_label_set_text(ui_lockScreenDate, rtc.getTime("%A, %B %d").c_str());
    // lv_label_set_text(ui_actionDate, rtc.getTime("%m/%d").c_str());
}


void callFunction(uint8_t type)
{
}

#ifdef MUSIC_PLAYER

void setVolume(int volume)
{
  Serial.printf("Set volume: %d\n", volume);
  audio.setVolume(volume);

  uint32_t act = audio.getAudioCurrentTime();
  uint32_t afd = audio.getAudioFileDuration();

  Serial.printf("Duration: %d / %d \n", act, afd);
}

// optional
void audio_info(const char *info)
{
  Serial.print("info        ");
  Serial.println(info);
  // info        Reading file: "/sky_high.mp3"
  String inf = String(info);
  if (inf.startsWith("Reading file:"))
  {
    String fl = inf.substring(16, inf.length() - 1);
    lv_label_set_text(ui_musicTrack, fl.c_str());
    lv_label_set_text(ui_musicMiniText, fl.c_str());
    lv_label_set_text(ui_musicArtist, "");
    lv_label_set_text(ui_musicAlbum, "");
  }
}
void audio_id3data(const char *info)
{ // id3 metadata
  Serial.print("id3data     ");
  Serial.println(info);
  String inf = String(info);
  if (inf.startsWith("Title: "))
  {
    String tt = inf.substring(7, inf.length());
    lv_label_set_text(ui_musicTrack, tt.c_str());
    lv_label_set_text(ui_musicMiniText, tt.c_str());
  }
  if (inf.startsWith("Artist: "))
  {
    String ats = inf.substring(8, inf.length());
    lv_label_set_text(ui_musicArtist, ats.c_str());
  }
  if (inf.startsWith("Album: "))
  {
    String alb = inf.substring(7, inf.length());
    lv_label_set_text(ui_musicAlbum, alb.c_str());
  }
}
void audio_eof_mp3(const char *info)
{ // end of file
  Serial.print("eof_mp3     ");
  Serial.println(info);

  int r = random(MAX_MUSIC);
  playFile(music[r].path);
}
void audio_bitrate(const char *info)
{
  Serial.print("bitrate     ");
  Serial.println(info);
}

#endif